def greek_to_latin(greek):

    converter = {
        'α': 'a', 'ά': 'a', 'ἆ': 'a', 'ἂ': 'a', 'ᾶ': 'a', 'ὰ': 'a', 'ἀ': 'a', 'ἄ': 'a', 'ἅ': 'a', 'ά': 'a', 'ἁ': 'a',
        'ᾳ': 'a', 'ἃ': 'a',
        'β': 'b',
        'γ': 'g',
        'δ': 'd',
        'έ': 'e', 'ε': 'e', 'ἒ': 'e', 'ὲ': 'e', 'ἐ': 'e', 'ἔ': 'e', 'έ': 'e', 'ἑ': 'e', 'ἓ': 'e', 'ἕ': 'e',
        'ζ': 'dz',
        'η': 'e', 'ή': 'e', 'ἦ': 'e', 'ἢ': 'e', 'ῆ': 'e', 'ὴ': 'e', 'ἠ': 'e', 'ἤ': 'e', 'ή': 'e', 'ἡ': 'e', 'ῇ': 'e',
        'ᾖ': 'e', 'ῃ': 'e', 'ἧ': 'e', "ñ": 'e', "ἣ": 'e',
        'θ': 'th',
        'ι': 'i', 'ί': 'i', 'ἶ': 'i', 'ἲ': 'i', 'ῖ': 'i', 'ὶ': 'i', 'ἰ': 'i', 'ἴ': 'i', "ί": "i", 'ἱ': 'i', 'ἵ': 'i',
        'í': 'i', 'ἷ': 'i',
        'κ': 'k',
        'λ': 'l',
        'μ': 'm',
        'ν': 'n',
        'ξ': 'ks',
        'ο': 'o', 'ό': 'o', 'ὂ': 'o', 'ὸ': 'o', 'ὀ': 'o', 'ὄ': 'o', 'ό': 'o', 'ὁ': 'o', 'ὅ': 'o', 'ὃ': 'o',
        'π': 'p',
        'ρ': 'r',
        'ς': 's', 'σ': 's',
        'τ': 't',
        'ύ': 'y', 'υ': 'y', 'ὖ': 'y', 'ὒ': 'y', 'ῦ': 'y', 'ὺ': 'y', 'ὐ': 'y', 'ὔ': 'y', 'ύ': 'y', 'ὑ': 'y', 'ὓ': 'y',
        'ὗ': 'y', 'ὕ': 'y',
        'φ': 'f',
        'χ': 'ch',
        'ψ': 'ps',
        'ω': 'o', 'ώ': 'o', 'ὦ': 'o', 'ὢ': 'o', 'ῶ': 'o', 'ὼ': 'o', 'ὠ': 'o', 'ὤ': 'o', 'ῷ': 'o', 'ὡ': 'o', 'ῳ': 'o',
        'ὧ': 'o', 'ώ': 'o', 'ὥ': 'o', 'ᾧ': 'o',
        '·': "", '-': ''
    }

    latin = ""
    for char in greek:
        try:
            latin += converter[char]
        except:
            latin += char

    return latin

